[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "MenuItemReviewForm";
+  const testIdPrefix = "";
 
   return (
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-itemid"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:45:24
           id="itemid"
           type="text"
           isInvalid={Boolean(errors.itemid)}
-          {...register("itemid", {
+          {...register("", {
             required: "ItemID is required.",
           })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:50:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.itemid?.message}
+          {errors.itemid.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:57:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="revieweremail">Reviewer Email</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-revieweremail"}
+          data-testid={testIdPrefix + ""}
           id="revieweremail"
           type="text"
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-revieweremail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:61:41
           id="revieweremail"
           type="text"
           isInvalid={Boolean(errors.revieweremail)}
-          {...register("revieweremail", {
-            required: "Reviewer Email is required.",
-          })}
+          {...register("revieweremail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:61:24
           id="revieweremail"
           type="text"
           isInvalid={Boolean(errors.revieweremail)}
-          {...register("revieweremail", {
+          {...register("", {
             required: "Reviewer Email is required.",
           })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:62:23
           type="text"
           isInvalid={Boolean(errors.revieweremail)}
           {...register("revieweremail", {
-            required: "Reviewer Email is required.",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:66:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.revieweremail?.message}
+          {errors.revieweremail.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:73:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="stars">Stars</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-stars"}
+          data-testid={testIdPrefix + ""}
           id="stars"
           type="text"
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-stars"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:78:23
           type="text"
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
-            required: "Stars is required.",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:93:24
           id="datereviewed"
           type="text"
           isInvalid={Boolean(errors.datereviewed)}
-          {...register("datereviewed", {
+          {...register("", {
             required: "Date Reviewed is required.",
           })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:98:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.datereviewed?.message}
+          {errors.datereviewed.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
