[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/menuitemreview/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: MenuItemReview tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreview/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/menuitemreview/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: MenuItemReview tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreview/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:45:17
 
     {
       Header: "ItemId",
-      accessor: "itemid",
+      accessor: "",
     },
     {
killedBy: MenuItemReview tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-itemid"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:47:5
       Header: "ItemId",
       accessor: "itemid",
     },
-    {
-      Header: "ReviewerEmail",
-      accessor: "revieweremail",
-    },
+    {},
     {
       Header: "Stars",
killedBy: MenuItemReview tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:49:17
     },
     {
       Header: "ReviewerEmail",
-      accessor: "revieweremail",
+      accessor: "",
     },
     {
killedBy: MenuItemReview tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-revieweremail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
