[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "UCSBOrganizationForm";
+  const testIdPrefix = "";
 
   return (
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:43:37
             data-testid={testIdPrefix + "-orgCode"}
             id="orgCode"
             type="text"
-            {...register("orgCode", {
-              required: "Organization Code is required.",
-            })}
+            {...register("orgCode", {})}
           />
           <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Organization Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:62:47
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
-          {...register("orgTranslationShort", {
-            required: "Organization Translation Short is required.",
-            maxLength: {
-              value: 15,
-              message: "Max length 15 characters",
-            },
-          })}
+          {...register("orgTranslationShort", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Organization Translation Short is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:66:24
             required: "Organization Translation Short is required.",
             maxLength: {
               value: 15,
-              message: "Max length 15 characters",
+              message: "",
             },
           })}
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 15 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:84:42
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
-          {...register("orgTranslation", {
-            required: "Organization Translation is required.",
-          })}
+          {...register("orgTranslation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Organization Translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:100:36
           id="inactive"
           type="text"
           isInvalid={Boolean(errors.inactive)}
-          {...register("inactive", {
-            pattern: {
-              value: /true|false/,
-              message: "Inactive status is required.",
-            },
-          })}
+          {...register("inactive", {})}
         >
           <option>Select an option</option>
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Inactive status is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
