[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (review) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: review.itemid,
-      reviewerEmail: review.revieweremail,
-      stars: review.stars,
-      localDateTime: review.datereviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:20:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(
-      `New review Created - id: ${review.id} email: ${review.reviewerEmail}`,
-    );
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New review Created - id: 1 email: test@gmail.com"

Number of calls: 0
