[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/menuitemreview/all"],
-    { method: "GET", url: "/api/menuitemreview/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: MenuItemReviewIndexPage tests renders three reviews correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/menuitemreview/create"
-          style={{ float: "right" }}
-        >
-          Create Menu Item Review
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item Review/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:30:27
         <Button
           variant="primary"
           href="/menuitemreview/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Menu Item Review
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
