[Killed] BlockStatement
src/main/utils/MenuItemReviewUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/menuitemreview",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: MenuItemReview tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/MenuItemReviewUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/menuitemreview",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: MenuItemReviewIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Review with id 1 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
