[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.js:29:34
     },
   );
 
-  const objectToAxiosPutParams = (review) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: review.id,
-    },
-    data: {
-      itemid: review.itemid,
-      revieweremail: review.revieweremail,
-      stars: review.stars,
-      datereviewed: review.datereviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 Reviewer Email: test1@ucsb.edu"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:35:11
     params: {
       id: review.id,
     },
-    data: {
-      itemid: review.itemid,
-      revieweremail: review.revieweremail,
-      stars: review.stars,
-      datereviewed: review.datereviewed,
-      comments: review.comments,
-    },
+    data: {},
   });
 
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"itemid\":\"2\",\"revieweremail\":\"test1@ucsb.edu\",\"stars\":\"6\",\"datereviewed\":\"2024-11-11T11:11:12\",\"comments\":\"great\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.js:44:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(
-      `Restaurant Updated - id: ${review.id} Reviewer Email: ${review.revieweremail}`,
-    );
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
