[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:47:5
       Header: "Org Translation Short",
       accessor: "orgTranslationShort",
     },
-    {
-      Header: "Org Translation",
-      accessor: "orgTranslation",
-    },
+    {},
     {
       Header: "Inactive",
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:48:15
       accessor: "orgTranslationShort",
     },
     {
-      Header: "Org Translation",
+      Header: "",
       accessor: "orgTranslation",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Org Translation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:52:15
       accessor: "orgTranslation",
     },
     {
-      Header: "Inactive",
+      Header: "",
       accessor: "inactive",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Inactive. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
