[Killed] ObjectLiteral
src/main/utils/UCSBOrganizationUtils.js:12:10
 // Stryker restore all
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganization",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.values.orgCode,
-    },
-  };
+  return {};
 }
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "UCSBOrganization with orgCode ACM was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/UCSBOrganizationUtils.js:13:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/ucsborganization",
+    url: "",
     method: "DELETE",
     params: {
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "UCSBOrganization with orgCode ACM was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
src/main/utils/UCSBOrganizationUtils.js:15:13
   return {
     url: "/api/ucsborganization",
     method: "DELETE",
-    params: {
-      orgCode: cell.row.values.orgCode,
-    },
+    params: {},
   };
 }
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "orgCode": "ACM",
- }
