[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:65:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "requesterEmail is required. "}
+              {errors.requesterEmail || "requesterEmail is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail && "professorEmail is required. "}
+              {errors.professorEmail || "professorEmail is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail && "professorEmail is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /professorEmail is required./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:103:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation && "explanation is required. "}
+              {errors.explanation || "explanation is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:103:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation && "explanation is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /explanation is required./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
