[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:60:17
     },
     {
       Header: "Done",
-      accessor: (RecommendationRequest) =>
-        RecommendationRequest.done.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: UserTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:


Ignored nodes: comments, script, style
