[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ArticlesForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="ArticlesForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:56:27
               type="text"
               isInvalid={Boolean(errors.title)}
               {...register("title", {
-                required: true,
+                required: false,
               })}
             />
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Title is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:132:28
               id="dateadded"
               type="datetime-local"
               isInvalid={Boolean(errors.dateadded)}
-              {...register("dateadded", {
+              {...register("", {
                 required: true,
                 pattern: isodate_regex,
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:133:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateadded)}
               {...register("dateadded", {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
statusReason: Error: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateadded && "LocalDateTime is required."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateadded && "LocalDateTime is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
