[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:56:17
     },
     {
       Header: "Date Added",
-      accessor: "dateadded",
+      accessor: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-dateadded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
