[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateadded: article.dateadded,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (article) => {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:11:13
   const objectToAxiosParams = (article) => ({
     url: "/api/articles/post",
     method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateadded: article.dateadded,
-    },
+    params: {},
   });
 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "dateadded": "2024-01-02T00:00",
-   "email": "email1@gmail.com",
