[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      id: article.id,
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateadded: article.dateadded,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (articles) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Article Updated - id: 17 title: Article17"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.js:29:10
   );
 
   const objectToAxiosPutParams = (article) => ({
-    url: "/api/articles",
+    url: "",
     method: "PUT",
     params: {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Article Updated - id: 17 title: Article17"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:31:13
   const objectToAxiosPutParams = (article) => ({
     url: "/api/articles",
     method: "PUT",
-    params: {
-      id: article.id,
-    },
+    params: {},
     data: {
       id: article.id,
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:34:11
     params: {
       id: article.id,
     },
-    data: {
-      id: article.id,
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateadded: article.dateadded,
-    },
+    data: {},
   });
 
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"id\":17,\"title\":\"Article17\",\"url\":\"https:url17.com\",\"explanation\":\"Explanation17\",\"email\":\"email17@gmail.com\",\"dateadded\":\"2026-01-02T00:00\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.js:44:35
     },
   });
 
-  const onSuccess = (articles) => {
-    toast(`Article Updated - id: ${articles.id} title: ${articles.title}`);
-  };
+  const onSuccess = (articles) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.js:45:11
   });
 
   const onSuccess = (articles) => {
-    toast(`Article Updated - id: ${articles.id} title: ${articles.title}`);
+    toast(``);
   };
 
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Article Updated - id: 17 title: Article17"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {articles && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={articles}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {articles && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={articles}
-          />
-        )}
+        {articles || <ArticlesForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={articles} />}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="ArticlesForm-title" id="title" name="title" type="text" /> instead
