[Killed] StringLiteral
main/pages/Articles/ArticlesIndexPage.js:18:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/articles/all"],
-    { method: "GET", url: "/api/articles/all" },
+    { method: "", url: "/api/articles/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: ArticlesIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/articles/all"
Received string:    "Error communicating with backend via  on /api/articles/all"
